# make sure brew is up to date
#brew update

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
# tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
# brew 'bash'

# Install more recent versions of some macOS tools
# brew 'grep'

# Install Binaries
# brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
# brew 'mackup'
# brew 'mas'
brew 'node'
brew 'trash'
brew 'cmake'
# brew 'wget'

# Development
# brew 'php71'
# brew 'php71-intl'
# brew 'php71-imagick'
# brew 'mcrypt'
# brew 'php71-mcrypt'
# brew 'composer' # Remember to update $PATH in .zshrc
# export PATH="$HOME/.npm-packages/bin:$(brew --prefix homebrew/php/php70)/bin:$PATH"
# brew 'mariadb'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'sublime-text'
# cask 'slack'
# cask 'mac2imgur'
# cask 'Caskroom/cask/karabiner-elements'
# cask 'caffeine'
# cask 'dropbox'
cask 'spectacle'
# cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
# cask 'gpgtools'
# cask 'insomnia'
# cask 'mysqlworkbench'
# cask 'now'
# cask 'phpstorm'
# cask 'quip'
# cask 'sequel-pro'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vlc'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
cask 'font-fira-code'

# Install Mac App Store apps
# mas '1Password', id: 443987910
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Gapplin', id: 768053424
# mas 'Giphy Capture', id: 668208984
# mas 'Paw', id: 584653203
# mas 'Sip', id: 507257563
# mas 'Sketch', id: 402476602
# mas 'Tweetbot', id: 557168941
