# make sure brew is up to date
#brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'homebrew/php'
tap "mongodb/brew"

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
# brew 'bash'

# Install more recent versions of some macOS tools
# brew 'grep'

# Install Binaries
brew 'git'
# https://stackoverflow.com/questions/59232089/how-to-install-gnu-grep-on-mac-os
# Please read above link to decide how you'll use grep
brew 'grep'
brew 'fzf'
brew 'ripgrep'
brew 'neofetch'
brew 'hub'
cask 'gh'
brew 'tree'
brew 'node'
brew 'trash'
brew 'cmake'
brew 'ssh-copy-id'
brew 'tmux'
brew 'wget'
brew 'zsh'
# brew 'mackup'
# brew 'mas'
# brew 'awscli'
# brew 'wget'

# databases
brew 'mongodb/brew/mongodb-community'
brew 'mysql'
brew 'sqllite'
brew 'postgress'

# Apps
cask 'alfred'
cask 'iterm2'
# alacritty is my new favorite terminal replacing iterm
cask 'alacritty'
cask 'sublime-text'
# cask 'visual-studio-code'
# I use vscodium because I like using neovim - if you are not, comment out this line and comment in the previous line
# note: If you had visual-studio-code installed you need to uninstall it with `$ brew uninstall visual-studio-code`
cask 'mongodb-compass'
cask 'vscodium'
cask 'slack'
cask 'mac2imgur'
# cask 'Caskroom/cask/karabiner-elements'
cask 'karabiner-elements'
cask 'caffeine'
cask 'dropbox'
# cask 'spectacle'
# rectangle replaces spectacle
cask 'rectangle'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'jumpcut'
cask 'insomnia'
cask 'postman'
cask 'mysqlworkbench'
cask 'grammarly'
cask 'neovim'
# cask 'gpgtools'
# cask 'now'
# cask 'phpstorm'
# cask 'quip'
# cask 'sequel-pro'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vlc'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-firacode-nerd-font-mono'

# Install Mac App Store apps
# mas '1Password', id: 443987910
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Gapplin', id: 768053424
# mas 'Giphy Capture', id: 668208984
# mas 'Paw', id: 584653203
# mas 'Sip', id: 507257563
# mas 'Sketch', id: 402476602
# mas 'Tweetbot', id: 557168941
